In [4]:
import pandas as pd
import seaborn as sns

In [54]:
#Loading the inbuilt dataset and printing the first 5 columns
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
#printing last 5 columns
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
#printing the shape of dataset
df.shape

(150, 5)

In [ ]:
#printing the column names
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [ ]:
#priting the mean for only numeric columns
df.mean(numeric_only=True)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [ ]:
#priting the standard deviation for only numeric columns
df.std(numeric_only = True)

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [ ]:
#statistical data of numeric columns
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
#statistical data of categorical columns
df.describe(include = "object")

       species
count      150
unique       3
top     setosa
freq        50

In [21]:
df = pd.read_csv(r"Datasets\nyc_weather.csv")
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [ ]:
#finding null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EST                   31 non-null     object
 1   Temperature           31 non-null     int64
 2   DewPoint              31 non-null     int64
 3   Humidity              31 non-null     int64
 4   Sea Level PressureIn  31 non-null     float64
 5   VisibilityMiles       31 non-null     int64
 6   WindSpeedMPH          28 non-null     float64
 7   PrecipitationIn       31 non-null     object
 8   CloudCover            31 non-null     int64
 9   Events                9 non-null      object
 10  WindDirDegrees        31 non-null     int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.8+ KB

In [23]:
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [26]:
#maximum in temperature column
df['Temperature'].max()

np.int64(50)

In [27]:
#select the row with maximum temperature
df[df["Temperature"] == df["Temperature"].max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [ ]:
#finding the event on the maximum temperature day
df["Events"][df["Temperature"] == df["Temperature"].max()]

9    Rain
Name: Events, dtype: object

In [31]:
#which date it rains
df['EST'][df["Events"]=="Rain"]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [34]:
#select the date when the temperature is maximum
df.EST[df.Temperature == df.Temperature.max()]   #df["Temperature"] (OR) df.Temperature

9    1/10/2016
Name: EST, dtype: object

In [38]:
#Average of Wind speed
df["WindSpeedMPH"].mean()

np.float64(6.892857142857143)

In [40]:
#To remove datatype from output
df["WindSpeedMPH"].mean().item()

6.892857142857143

Data Frame to cvs & Excel

In [43]:
data = {"Name ": ["srinu","vasu","charan","bharath","ajay"],
        "Age ": [21,22,23,21,20],
        "Marks ":[98,97,99,98,99]}
df = pd.DataFrame(data)
df

     Name   Age   Marks
0    srinu    21      98
1     vasu    22      97
2   charan    23      99
3  bharath    21      98
4     ajay    20      99

In [ ]:
#To csv and removing index in csv file
df.to_csv(r"C:\Users\reddy\OneDrive\Desktop\Machine_learning_basics\Datasets\new_csv_file.csv",index = False)

In [53]:
#to excel and student details as sheet 1
df.to_excel(r"C:\Users\reddy\OneDrive\Desktop\Machine_learning_basics\Datasets\new_excel.xlsx",sheet_name="student_details",index = False)